apache/nuttx/arch/arm/src/lpc313x/lpc313x_serial.c
  /* Configuration the serial console */

#if defined(CONFIG_UART_SERIAL_CONSOLE)
  g_uartport.isconsole = true;
  up_setup(&g_uartport);
#endif
}

/****************************************************************************
 * Name: up_serialinit
 *
 * Description:
 *   Register serial console and serial ports.  This assumes that
 *   up_earlyserialinit was called previously.
 *
 ****************************************************************************/

void up_serialinit(void)
{
#if defined(CONFIG_UART_SERIAL_CONSOLE)
  (void)uart_register("/dev/console", &g_uartport);
#endif
  (void)uart_register("/dev/ttyS0", &g_uartport);
}

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug  writes
 *
 ****************************************************************************/

int up_putc(int ch)
{
  struct up_dev_s *priv = g_uartpriv;
  uint8_t ier;

  up_disableuartint(priv, &ier);
  up_waittxready(priv);
  putreg32((uint32_t)ch, LPC313X_UART_THR);

  /* Check for LF */

  if (ch == '\n')
    {
      /* Add CR */

      up_waittxready(priv);
      putreg32('\r', LPC313X_UART_THR);
    }

  up_waittxready(priv);
  up_restoreuartint(priv, ier);
  return ch;
}

#else /* CONFIG_USE_SERIALDRIVER */

/****************************************************************************
 * Name: up_putc
 *
 * Description:
 *   Provide priority, low-level access to support OS debug writes
 *
 ****************************************************************************/

int up_putc(int ch)
{
  /* Check for LF */

  if (ch == '\n')
    {
      /* Add CR */

      up_lowputc('\r');
    }

  up_lowputc(ch);
  return ch;
}

#endif /* CONFIG_USE_SERIALDRIVER */
